8bitgeek/caribou-rtos/caribou/target/chip/stm32/stm32f091/src/uart.c
/******************************************************************************
* Copyright © 2005-2013 by Pike Aerospace Research Corporation
* All Rights Reserved
*
*   This file is part of CARIBOU RTOS
*
*   CARIBOU RTOS is free software: you can redistribute it and/or modify
*   it under the terms of the Beerware License Version 43.
*
* ----------------------------------------------------------------------------
* "THE BEER-WARE LICENSE" (Revision 43):
* <mike@pikeaero.com> wrote this file. As long as you retain this notice you
* can do whatever you want with this stuff. If we meet some day, and you think
* this stuff is worth it, you can buy me a beer in return ~ Mike Sharkey
* ----------------------------------------------------------------------------
******************************************************************************/
#include <caribou/lib/stdio.h>
#include <caribou/lib/errno.h>
#include <caribou/lib/heap.h>
#include <caribou/lib/string.h>
#include <caribou/kernel/interrupt.h>
#include <chip/chip.h>
#include <chip/uart.h>
#include <board.h>

#include <stm32f0xx.h>
#include <stm32f0xx_gpio.h>
#include <stm32f0xx_usart.h>
#include <stm32f0xx_rcc.h>
#include <stm32f0xx_dma.h>

//  DMA1_Ch1_IRQn               = 9,      /*!< DMA1 Channel 1 Interrupt                                        */
//  DMA1_Ch2_3_DMA2_Ch1_2_IRQn  = 10,     /*!< DMA1 Channel 2 and 3 & DMA2 Channel 1 and 2 Interrupts          */
//  DMA1_Ch4_7_DMA2_Ch3_5_IRQn  = 11,     /*!< DMA1 Channel 4 to 7 & DMA2 Channel 3 to 5 Interrupts            */

typedef struct
{
	caribou_bytequeue_t*	queue;				/// The data queue
	bool					dma_enabled;		/// The DMA channel is enabled?
	DMA_TypeDef*			dma;				/// The DMA controller.
	uint32_t				dma_channel_remap;	/// The DMA channel remap selector.
	DMA_Channel_TypeDef*	dma_channel;		/// The DMA channel.
	InterruptVector			dma_vector;			/// The DMA channel interrupt vector.
	uint32_t				dma_tcif;			/// The DMA channel transfer complete interrupt flag.
	uint32_t				dma_port;			/// The Address of the peripheral port to use for DMA.
    uint32_t				dma_prio;			/// The DMA Channel priority
} chip_uart_queue_t;

typedef struct
{
	USART_TypeDef*			base_address;		/// The base USART port address.
	InterruptVector			vector;				/// The interrupt vector for the USART port.
	caribou_uart_config_t	config;				/// The UART configuration (baud,stop bits,parity,etc..) */
	uint32_t				status;				/// The device driver status bits.
	chip_uart_queue_t		rx;					/// The receive queue.
	chip_uart_queue_t		tx;					/// The transmit queue
} chip_uart_private_t;

chip_uart_private_t device_info[] =
{
	// USART1
	{ 
		(USART_TypeDef*)USART1_BASE,			/// The base USART port address.
		USART1_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue DMA1 Channel 1
			NULL,								/// I/O Byte Queue
			false,								/// DMA Enabled
			DMA1,								/// DMA Controller
			DMA_RMPCR1_CH1_USART1_RX,			/// DMA Channel Remap
			DMA1_Channel1,						/// DMA Channel
			DMA1_Ch1_IRQn,						/// DMA Channel Interrupt Vector
            DMA_ISR_TCIF1,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART1->RDR,				/// Receive Data Register
			DMA_Priority_Low					/// DMA Channel Priority
		},		
		{	/// The TX queue DMA1 Channel 4
			NULL,								/// I/O Byte Queue
			false,								/// DMA Enabled
			DMA1,								/// DMA Controller
			DMA_RMPCR1_CH4_USART1_TX,			/// DMA Channel Remap
			DMA1_Channel4,						/// DMA Channel
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,			/// DMA Channel Interrupt Vector
            DMA_ISR_TCIF4,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART1->TDR,				/// Transmit Data Register
			DMA_Priority_Low					/// DMA Channel Priority
		},		
	},
	// USART2
	{ 
		(USART_TypeDef*)USART2_BASE,			/// The base USART port address.
		USART2_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue DMA1 Channel 5
			NULL,
			false,
			DMA1,
			DMA_RMPCR1_CH5_USART2_RX,
			DMA1_Channel5,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF5,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART2->RDR,
			DMA_Priority_Low
		},		
		{	/// The TX queue DMA1 Channel 7
			NULL,
			false,
			DMA1,
			DMA_RMPCR1_CH7_USART2_TX,
			DMA1_Channel7,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF7,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART2->TDR,
			DMA_Priority_Low
		},		
	},
	// USART3
	{ 
		(USART_TypeDef*)USART3_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue DMA1 Channel 6
			NULL,
			false,
			DMA1,
			DMA_RMPCR1_CH6_USART3_RX,
			DMA1_Channel6,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF6,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART3->RDR,
			DMA_Priority_Low
		},		
		{	/// The TX queue DMA2 Channel 1
			NULL,
			false,
			DMA2,
			DMA_RMPCR2_CH1_USART3_TX,
			DMA2_Channel1,
            DMA1_Ch2_3_DMA2_Ch1_2_IRQn,
            DMA_ISR_TCIF1,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART3->TDR,
			DMA_Priority_Low
		},		
	},
	// USART4
	{ 
		(USART_TypeDef*)USART4_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue DMA2 Channel 2
			NULL,
			false,
			DMA2,
			DMA_RMPCR2_CH2_USART4_RX,
			DMA2_Channel2,
            DMA1_Ch2_3_DMA2_Ch1_2_IRQn,
            DMA_ISR_TCIF2,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART4->RDR,
			DMA_Priority_Low
		},		
		{	/// The TX queue DMA2 Channel 4
			NULL,
			false,
			DMA2,
			DMA_RMPCR2_CH4_USART4_TX,
			DMA2_Channel4,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF4,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART4->TDR,
			DMA_Priority_Low
		},		
	},
	// USART5
	{ 
		(USART_TypeDef*)USART5_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue DMA2 Channel 3
			NULL,
			false,
			DMA2,
			DMA_RMPCR2_CH3_USART5_RX,
			DMA2_Channel3,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF3,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART5->RDR,
			DMA_Priority_Low
		},		
		{	/// The TX queue DMA1 Channel 4
			NULL,
			false,
			DMA1,
			DMA_RMPCR2_CH5_USART5_TX,
			DMA2_Channel5,
            DMA1_Ch4_7_DMA2_Ch3_5_IRQn,
            DMA_ISR_TCIF4,						/// DMA Transfer Complete Interrupt Flag.
			(uint32_t)&USART5->TDR,
			DMA_Priority_Low
		},		
	},
	// USART6
	{ 
		(USART_TypeDef*)USART6_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue no DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART1->RDR,
			0
		},		
		{	/// The TX queue No DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART6->TDR,
			0
		},		
	},
	// USART7
	{ 
		(USART_TypeDef*)USART7_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue no DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART7->RDR,
			0
		},		
		{	/// The TX queue no DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART7->TDR,
			0
		},		
	},
	// USART8
	{ 
		(USART_TypeDef*)USART8_BASE,			/// The base USART port address.
		USART3_8_IRQn,							/// The interrupt vector for the USART port.
		CARIBOU_UART_CONFIG_INIT,				/// The UART BAUD rate
		0,										/// The device driver status bits.
		{	/// The RX queue No DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART8->RDR,
			0
		},		
		{	/// The TX queue No DMA
			NULL,
			false,
			NULL,
			0,
			0,
			0,
			0,
			(uint32_t)&USART8->TDR,
			0
		},		
	},
	{	
		0,
		0, 
		{0,0,0,0,0},
		0, 
		{NULL,0,0,NULL,NULL,0},					/// The RX queue
		{NULL,0,0,NULL,NULL,0},					/// The TX queue
	},
};

