8bitgeek/caribou-rtos/caribou/target/chip/stm32/stm32f091/src/uart.c
const stdio_t _stdio_[] =
{
	{ 
		&device_info[0], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
#if !defined(CARIBOU_COMPACT)  /* Value-Line STM32F0xx or only use first USART */
	{ 
		&device_info[1], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[2], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[3], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[4], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[5], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[6], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
	{ 
		&device_info[7], 
		caribou_uart_private_readfn, 
		caribou_uart_private_writefn, 
		caribou_uart_private_readqueuefn, 
		caribou_uart_private_writequeuefn, 
		caribou_uart_private_statefn 
	},
#endif
	{ NULL, NULL, NULL, NULL, NULL, NULL },
};

static int chip_uart_enable_dma_rx(chip_uart_private_t* private_device);
static int chip_uart_disable_dma_rx(chip_uart_private_t* private_device);

static int chip_uart_enable_dma_tx(chip_uart_private_t* private_device);
static int chip_uart_disable_dma_tx(chip_uart_private_t* private_device);

static void isr_uart_dma(InterruptVector vector,void* arg);
static void isr_uart(InterruptVector vector,void* arg);

static uint32_t chip_uart_interrupt_mask(chip_uart_private_t* private_device)
{
	uint32_t mask=0x00000000;
	if ( !private_device->rx.dma_enabled )
	{
		mask |= USART_CR1_RXNEIE;
	}
	return mask;
}

/// Enables device interrupts.
int chip_uart_int_enable(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	int rc = chip_uart_int_enabled(private_device);
	private_device->base_address->CR1 |= chip_uart_interrupt_mask(private_device);
	return rc;
}

/// Disables device interrupts.
/// @return the previous state
int chip_uart_int_disable(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	int rc = chip_uart_int_enabled(private_device);
   	private_device->base_address->CR1 &= ~chip_uart_interrupt_mask(private_device);
	return rc;
}

/// Interrupts Enabled?
int chip_uart_int_enabled(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	int rc = (private_device->base_address->CR1 & chip_uart_interrupt_mask(private_device)) ? 1 : 0;
	return rc;
}

/// Set interrupts to a previous state
int chip_uart_int_set(void* device, int state)
{
	int rc = chip_uart_int_enabled(device);
	if ( state )
		uart_enable_interrupts(device);
	else
		uart_disable_interrupts(device);
	return rc;
}

/// Enables transmitting and receiving.
static void uart_enable(chip_uart_private_t* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->base_address->CR1 |= USART_CR1_UE;
}

/// Disables transmitting and receiving.
static void uart_disable(chip_uart_private_t* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->base_address->CR1 &= ~USART_CR1_UE;
}

/**
 * @brief The DMA head pointer for the UART bytequeue channel.
 * @param d void* pointer assumed to be NULL or pointer to a DMA_Stream_TypeDef*
 * @return The offset expressed as positive integer relative to start of buffer.
 */
static uint16_t chip_uart_bytequeue_dma_head(caribou_bytequeue_t* queue,void* d)
{
	DMA_Channel_TypeDef* channel = (DMA_Channel_TypeDef*)d;
	uint16_t head = queue->size - channel->CNDTR;
	return head;
}

/**
 * @brief The DMA tail pointer for the UART bytequeue channel.
 * @param d void* pointer assumed to be NULL or pointer to a DMA_Stream_TypeDef*
 * @return The offset expressed as positive integer relative to start of buffer.
 */
static uint16_t chip_uart_bytequeue_dma_tail(caribou_bytequeue_t* queue,void* d)
{
	DMA_Channel_TypeDef* channel = (DMA_Channel_TypeDef*)d;
	uint16_t head = queue->size - channel->CNDTR;
	return head;
}

/**
 * @brief Enable U(S)ART DMA on the receiver. 
 * Received bytes a placed round-robin into the the receivers's queue.
 */
static int chip_uart_enable_dma_rx(chip_uart_private_t* private_device)
{
	DMA_Channel_TypeDef* channel = private_device->rx.dma_channel;
	uint32_t channel_remap = private_device->rx.dma_channel_remap;

	chip_uart_disable_dma_rx(private_device);

	/* Set the bytequeue head-pointer callback function to use DMA byte count... */
	caribou_bytequeue_set_head_fn(private_device->rx.queue,chip_uart_bytequeue_dma_head,channel);

	/* Configure the channel remap... */
	if ( (uint32_t)channel > (uint32_t)DMA2_BASE )	/* Is DMA2? */
	{
		DMA2->RMPCR |= private_device->rx.dma_channel_remap;
	}
	else	/* Must be DMA1... */
	{
		DMA1->RMPCR |= private_device->rx.dma_channel_remap;
	}

	channel->CCR = 0;
	channel->CCR |=	(
						private_device->rx.dma_prio	|					/* channel priority */
                        DMA_CCR_MINC				|					/* memory increment */
						DMA_CCR_CIRC									/* circular mode */
					);

	channel->CNDTR = (uint16_t)private_device->rx.queue->size;			/* the data size */
	channel->CPAR = (uint32_t)private_device->rx.dma_port;				/* the peripheral address */
	channel->CMAR = (uint32_t)private_device->rx.queue->queue;			/* the destination memory address */

