8bitgeek/caribou-rtos/caribou/target/chip/stm32/stm32f091/src/uart.c
	/* Enable the USART Rx DMA request */
	private_device->base_address->CR3 |= USART_DMAReq_Rx;

	/* Let the device driver functions know that dma is enabled */
	private_device->rx.dma_enabled = true;

	/* Install and enable the DMA interrupt vector */
	caribou_vector_install(private_device->rx.dma_vector,isr_uart_dma,private_device);
	caribou_vector_enable(private_device->rx.dma_vector);

	/* Enable the DMA RX Stream */
	channel->CCR |= DMA_CCR_EN;
}

static int chip_uart_disable_dma_rx(chip_uart_private_t* private_device)
{
	DMA_Channel_TypeDef* channel = private_device->rx.dma_channel;
	uint32_t channel_remap = private_device->rx.dma_channel_remap;

	/* Disable the USART Rx DMA request */
	private_device->base_address->CR3 &= ~USART_DMAReq_Rx;

	/* Disable the DMA RX Stream */
	channel->CCR &= ~DMA_CCR_EN;

   	private_device->rx.dma_enabled = false;
   	caribou_bytequeue_set_head_fn(private_device->rx.queue,NULL,NULL);
}

static int chip_uart_enable_dma_tx(chip_uart_private_t* private_device)
{
	DMA_Channel_TypeDef* channel = private_device->tx.dma_channel;
	uint32_t channel_remap = private_device->tx.dma_channel_remap;

	chip_uart_disable_dma_tx(private_device);

	/* Set the bytequeue tail-pointer callback function to use DMA byte count... */
	caribou_bytequeue_set_tail_fn(private_device->tx.queue,chip_uart_bytequeue_dma_tail,channel);

	/* Configure the channel remap... */
	if ( (uint32_t)channel > (uint32_t)DMA2_BASE )	/* Is DMA2? */
	{
		DMA2->RMPCR |= private_device->tx.dma_channel_remap;
	}
	else	/* Must be DMA1... */
	{
		DMA1->RMPCR |= private_device->tx.dma_channel_remap;
	}

	channel->CCR = 0;
	channel->CCR |=	(
						private_device->tx.dma_prio	|					/* channel priority */
                        DMA_CCR_MINC				|					/* memory increment */
						DMA_CCR_CIRC				|					/* circular mode */
						DMA_CCR_DIR										/* from memory to peripheral */
					);


	channel->CNDTR = (uint16_t)0; /* private_device->tx.queue->size; */	/* the data size */
	channel->CPAR = (uint32_t)private_device->tx.dma_port;				/* the peripheral address */
	channel->CMAR = (uint32_t)private_device->tx.queue->queue;			/* the source memory address */

	/* Enable the USART Tx DMA request */
	private_device->base_address->CR3 |= USART_DMAReq_Tx;

	/* Install and enable the DMA interrupt vector */
	caribou_vector_install(private_device->tx.dma_vector,isr_uart_dma,private_device);
	caribou_vector_enable(private_device->tx.dma_vector);

	/* Let the device driver functions know that dma is enabled */
	private_device->tx.dma_enabled = true;

	/* Disable the DMA Tx Stream */
	channel->CCR &= ~DMA_CCR_EN;
}

static int chip_uart_disable_dma_tx(chip_uart_private_t* private_device)
{
	DMA_Channel_TypeDef* channel = private_device->rx.dma_channel;
	uint32_t channel_remap = private_device->rx.dma_channel_remap;

	/* Disable the USART Rx DMA request */
	private_device->base_address->CR3 &= ~USART_DMAReq_Rx;

	/* Disable the DMA RX Stream */
	channel->CCR &= ~DMA_CCR_EN;

   	private_device->tx.dma_enabled = false;
}

/// Set the uart parameters
int chip_uart_set_config(void* device,caribou_uart_config_t* config)
{
	int rc=(-1);
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	if ( !config )
	{
		config = &private_device->config;
	}
	private_device->base_address->CR1 &= ~USART_CR1_UE;	/* disable the UART */
	if ( config )
	{
		USART_InitTypeDef USART_InitStructure;
		USART_InitStructure.USART_BaudRate = (int)config->baud_rate;
		USART_InitStructure.USART_WordLength = (int)config->word_size;

		switch ( config->word_size )
		{
			default:
			case CARIBOU_UART_WORDSIZE_5:				/* Word size 5 bits */
			case CARIBOU_UART_WORDSIZE_6:				/* Word size 6 bits */
			case CARIBOU_UART_WORDSIZE_7:				/* Word size 7 bits */
			case CARIBOU_UART_WORDSIZE_8:				/* Word size 8 bits */
				USART_InitStructure.USART_WordLength = USART_WordLength_8b;
				break;
			case CARIBOU_UART_WORDSIZE_9:				/* Word size 9 bits */		
				USART_InitStructure.USART_WordLength = USART_WordLength_9b;
				break;
		}

		switch ( config->stop_bits )
		{
			case CARIBOU_UART_STOPBITS_05:
				//USART_InitStructure.USART_StopBits = USART_StopBits_0_5;
				//break;
			default:
			case CARIBOU_UART_STOPBITS_1:
				USART_InitStructure.USART_StopBits = USART_StopBits_1;
				break;
			case CARIBOU_UART_STOPBITS_15:
				USART_InitStructure.USART_StopBits = USART_StopBits_1_5;
				break;
			case CARIBOU_UART_STOPBITS_2:
				USART_InitStructure.USART_StopBits = USART_StopBits_2;
				break;
		}

		switch( config->parity_bits )
		{
			default:
			case CARIBOU_UART_PARITY_NONE:
				USART_InitStructure.USART_Parity = USART_Parity_No;
				break;
			case CARIBOU_UART_PARITY_ODD:
				USART_InitStructure.USART_Parity = USART_Parity_Odd;
				break;
			case CARIBOU_UART_PARITY_EVEN:
				USART_InitStructure.USART_Parity = USART_Parity_Even;
				break;
		}

		switch( config->flow_control )
		{
			default:
			case CARIBOU_UART_FLOW_NONE:		/* no flow control */
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
				break;
			case CARIBOU_UART_FLOW_RTS:			/* RTS flow control */
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
				break;
			case CARIBOU_UART_FLOW_CTS:			/* CTS flow control */
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
				break;
			case CARIBOU_UART_FLOW_RTS_CTS:		/* RTS+CTS flow control */
				USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
				break;
		}

		USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
		USART_Init(private_device->base_address, &USART_InitStructure);
		private_device->base_address->CR1 |= USART_CR1_UE;	/* enable the UART */
		
		if ( config->dma_mode != CARIBOU_UART_DMA_NONE )
		{
			/* dma channel(s) priority */
			switch( config->dma_prio )
			{
				case CARIBOU_UART_DMA_PRIO_DEFAULT:	
					break;
				case CARIBOU_UART_DMA_PRIO_LOW:		
					private_device->rx.dma_prio = DMA_Priority_Low;			
					break;
				case CARIBOU_UART_DMA_PRIO_MEDIUM:	
					private_device->rx.dma_prio = DMA_Priority_Medium;		
					break;
				case CARIBOU_UART_DMA_PRIO_HIGH:	
					private_device->rx.dma_prio = DMA_Priority_High;		
					break;
				case CARIBOU_UART_DMA_PRIO_HIGHEST:	
					private_device->rx.dma_prio = DMA_Priority_VeryHigh;	
					break;
			}
			caribou_vector_disable(private_device->vector);
           	private_device->base_address->CR1 &= ~chip_uart_interrupt_mask(private_device);
			if ( config->dma_mode & CARIBOU_UART_DMA_RX )
			{
				chip_uart_enable_dma_rx(private_device);
			}
			if ( config->dma_mode & CARIBOU_UART_DMA_TX )
			{
				chip_uart_enable_dma_tx(private_device);
			}
		}

