8bitgeek/caribou-rtos/caribou/target/chip/stm32/stm32f091/src/uart.c
		/* Install and Enable the UART Interrupt Vector */
		caribou_vector_install(private_device->vector,isr_uart,private_device);
		caribou_vector_enable(private_device->vector);
		/* Enable the UART peripheral Interrupt Enable Flags */
		private_device->base_address->CR1 |= chip_uart_interrupt_mask(private_device);
		rc=0;
	}
	return rc;
}

/// External open  a uart device
int chip_uart_open(int fd)
{
	return fd;
}

/// External close  a uart device
int chip_uart_close(int fd)
{
	return fd;
}

caribou_bytequeue_t* chip_uart_set_rx_queue(void* device, caribou_bytequeue_t* rx_queue)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->rx.queue = rx_queue;
	return rx_queue;
}

caribou_bytequeue_t* chip_uart_set_tx_queue(void* device, caribou_bytequeue_t* tx_queue)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->tx.queue = tx_queue;
	return tx_queue;
}

caribou_bytequeue_t* chip_uart_rx_queue(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
    return private_device->rx.queue;
}

caribou_bytequeue_t* chip_uart_tx_queue(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
    return private_device->tx.queue;
}

InterruptVector chip_uart_interrupt_vector(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	return private_device->vector;
}

uint32_t chip_uart_status(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	return private_device->status;
}

extern uint32_t chip_uart_set_status(void* device,uint32_t status)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->status = status;
	return private_device->status;
}

bool chip_uart_tx_busy(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
    bool rc = (private_device->base_address->ISR & USART_FLAG_TC) ? false : true;
	return rc;
}

bool chip_uart_tx_ready(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
    bool rc = (private_device->base_address->ISR & USART_FLAG_TXE) ? true : false;
	return rc;
}

bool chip_uart_rx_ready(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	uint32_t sr = private_device->base_address->ISR;
    bool rc = (sr & (USART_FLAG_RXNE|USART_FLAG_ORE)) ? true : false;
	return rc;
}

int chip_uart_tx_data(void* device,int ch)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->base_address->TDR = ch;
	return ch;
}

int chip_uart_rx_data(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	return private_device->base_address->RDR;
}	

/* start the transmitter, usually enable transmitter interrupts, pend interrupt. */
void chip_uart_tx_start(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	if ( private_device->tx.dma_enabled )
	{
		/* Get a pointer to the DMA channel from the private device */
		DMA_Channel_TypeDef* channel = private_device->tx.dma_channel;

		/* Is the channel already running? */
		if ( channel->CCR & DMA_CCR_EN )
		{
			/* If we're already doing a DMA transfer, then nothing to do, else start it... */
			if ( channel->CCR & DMA_CCR_EN )
			{
				uint32_t dmaBytes=0;		/* Number of bytes to transfer */
				uint32_t qHead = (uint32_t)caribou_bytequeue_head(private_device->tx.queue);
				uint32_t qTail = (uint32_t)caribou_bytequeue_tail(private_device->tx.queue);

				if ( qHead > qTail )
				{
					/* We will not wrap around the bytequeue buffer on this pass. */
					dmaBytes = qHead - qTail;
				}
				else
				if ( qHead < qTail )
				{
					/* We will wrap around, so we have to do this in two stages. First, DMA up until the wrap,
					   generate an interrupt at that point, then start the remainder. */
					dmaBytes = caribou_bytequeue_size(private_device->tx.queue) - qTail;
				}

				/* Do we have anything to do? */
				if ( dmaBytes > 0 )
				{
					/* Populate the channel source memory pointer and the number of transfers */
					channel->CMAR = (uint32_t)&private_device->tx.queue->queue[qTail];	/* the source memory address */
					channel->CNDTR = dmaBytes;

					/* Enable channel interrupt after completion */
					channel->CCR |= private_device->tx.dma_tcif;
	
					/* Enable The DMA Tx Stream */
					channel->CCR |= DMA_CCR_EN;
				}
			}
		}
	}
	else
	{
		private_device->base_address->CR1 |= USART_CR1_TXEIE;
	}
}

/* Stop the transmitter, usually disable transmitter interrupts */
void chip_uart_tx_stop(void* device)
{
	chip_uart_private_t* private_device = (chip_uart_private_t*)device;
	private_device->base_address->CR1 &= ~USART_CR1_TXEIE;
}

/* UART DMA interrupt service routine */
static void isr_uart_dma(InterruptVector vector,void* arg)
{
	/* private device passed as isr argument */
	chip_uart_private_t* private_device = (chip_uart_private_t*)arg;

	if ( private_device->tx.dma_vector == vector )						
	{
		/* DMA Transmit interrupt */
		if ( private_device->tx.dma->ISR & private_device->tx.dma_tcif )
		{
			/* clear the interrupt */
			private_device->tx.dma->IFCR = private_device->tx.dma_tcif;
		}
	}
	else
	if ( private_device->rx.dma_vector == vector )						
	{
		/* DMA Receiver interrupt */
		if ( private_device->tx.dma->ISR & private_device->rx.dma_tcif )
		{
		}
	}
}

/* UART interrupt service routine */
static void isr_uart(InterruptVector vector,void* arg)
{
	/* private device passed as isr argument */
	chip_uart_private_t* device = (chip_uart_private_t*)arg;
	 
	if ( device->vector == vector )
	{
		// Empty out the UART receiver..
		while ( !device->rx.dma_enabled && chip_uart_rx_ready(device) )
		{
			if ( !caribou_bytequeue_put(device->rx.queue,chip_uart_rx_data(device) ) )
			{
				device->status |= STDIO_STATE_RX_OVERFLOW;
			}
			device->status |= STDIO_STATE_RX_PENDING;
		}
		// While transmitter empty and tx queue has data, then transmit...
		if ( !caribou_bytequeue_empty(device->tx.queue) )
		{
			// Transmitter shift register is ready?
			if ( chip_uart_tx_ready(device) )
			{
				chip_uart_tx_data(device,caribou_bytequeue_get(device->tx.queue));
			}
		}
		// Disable transmitter empty interrupts so we don't re-enter the interrupt handler.
		if ( caribou_bytequeue_empty(device->tx.queue) )
		{
			chip_uart_tx_stop(device);
		}
		device->base_address->ICR = USART_ICR_ORECF; // clear the overrun flag 
	}
}

